app/Controllers/Home.php

    public function Kegiatan_Home()
    {
       $data = [
            'title' => 'Kegiatan',
            'kegiatan' =>$this->KegiatanModel->paginate(6, 'tb_kegiatan'),
---
SELECT *
FROM `tb_kegiatan`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `tb_kegiatan`

    public function Shop()
    {

       $data = [
            'title' => 'Shop',
            'produk' =>$this->ProdukModel->paginate(9, 'produk'),
---
SELECT *
FROM `produk`
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `produk`