app/Models/KegiatanModel.php

SELECT *
FROM `tb_kegiatan`
ORDER BY `id_kegiatan` DESC
---
    public function get_kegiatan()
    {
        return  $this->db->table('tb_kegiatan')->orderBy('id_kegiatan','desc')->get()->getResultArray();

SELECT *
FROM `tb_kegiatan`
WHERE `id_kegiatan` = '21'
---
    public function edit_kegiatan($id_kegiatan)
    {
        return $this->db->table('tb_kegiatan')->where('id_kegiatan',$id_kegiatan)->get()->getRowArray();