app/Models/KegiatanModel.php

SELECT *
FROM `tb_kegiatan`
---
    public function get_kegiatan()
    {
        return $this->db->table('tb_kegiatan')->get()->getResultArray();