app/Models/ProdukModel.php

SELECT *
FROM `produk`
---
    public function get_produk()
    {
        return $this->db->table('produk')->get()->getResultArray();

SELECT *
FROM `produk`
WHERE `id_produk` = '27'
---
    public function edit_produk($id_produk)
    {
        return $this->db->table('produk')->where('id_produk',$id_produk)->get()->getRowArray();