app/Models/ProfilModel.php

    public function get_profil()
    {
        return $this->db->table('tb_profil')->get()->getResultArray();
---
SELECT *
FROM `tb_profil`