app/Models/ServicesModel.php

    public function get_Services()
    {
        return  $this->db->table('tb_Services')->orderBy('id_Services','desc')->get()->getResultArray();
---
SELECT *
FROM `tb_Services`
ORDER BY `id_Services` DESC